HongHanPT/Programming/SDK_2.7.0_MKE15Z256xxx7/boards/frdmke15z/driver_examples/gpio/led_output/gpio_led_output.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "board.h"
#include "fsl_debug_console.h"
#include "fsl_gpio.h"

#include "pin_mux.h"
#include "clock_config.h"

#include "GLCD.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define BOARD_LED_GPIO BOARD_LED_RED_GPIO
#define BOARD_LED_GPIO_PIN BOARD_LED_RED_GPIO_PIN

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief delay a while.
 */
void delay(unsigned int time);
bool check_button(void);
void scan_row(unsigned char col);
unsigned char check_row(void);
char check_key(void);
/*******************************************************************************
 * Variables
 ******************************************************************************/
unsigned char key[4][3] = {{'5','1','9'},{'7','3','#'},{'4','0','8'},{'6','2','*'}};
volatile uint32_t g_systickCounter=0;
char selected =0;
char PRESS1, PRESS2, HOLD1, HOLD2, PRESS0;
/*******************************************************************************
 * Code
 ******************************************************************************/
void SysTick_Handler(void)
{
    if (g_systickCounter != 0xFFFFFFFF)
    {
        g_systickCounter++;
    }
    else g_systickCounter = 0;
}

void SysTick_DelayTicks(uint32_t n)
{
    g_systickCounter = n;
    while (g_systickCounter != 0U)
    {
    }
}

/**
 * @brief 
 * 
 * @param    
 * @retval
 */
void delay(unsigned int time)
{
    volatile uint32_t i = 0;
    for (unsigned int cnt = 0; cnt<=time;cnt++)
    {
      for (i = 0; i < 100; ++i)
      {
          __asm("NOP"); /* delay */
      }
    }
}


/**
 * @brief 
 * 
 * @param    
 * @retval
 */
bool check_button(void)
{
    GPIO_PinWrite(GPIOE, 8U, 0);
    GPIO_PinWrite(GPIOB, 5U, 0);
    GPIO_PinWrite(GPIOC, 3U, 0);
    if((!GPIO_PinRead(GPIOC, 2U))||(!GPIO_PinRead(GPIOD, 6U))||(!GPIO_PinRead(GPIOD, 7U))||(!GPIO_PinRead(GPIOD, 5U)))
      return 1;
    return 0;    
}


/**
 * @brief 
 * 
 * @param    
 * @retval
 */
void scan_col(unsigned char col)
{
    GPIO_PinWrite(GPIOE, 8U, 1);
    GPIO_PinWrite(GPIOB, 5U, 1);
    GPIO_PinWrite(GPIOC, 3U, 1);
    if (col ==1) 
        GPIO_PinWrite(GPIOE, 8U, 0);
     else if (col == 2) 
        GPIO_PinWrite(GPIOB, 5U, 0);
     else if (col == 3)
        GPIO_PinWrite(GPIOC, 3U, 0);
 
}


/**
 * @brief 
 * 
 * @param    
 * @retval
 */
unsigned char check_row(void)
{
    unsigned char row = 0;
    if (!GPIO_PinRead(GPIOC, 2U)) row =1;
    else if (!GPIO_PinRead(GPIOD, 6U)) row =2;
    else if (!GPIO_PinRead(GPIOD, 7U)) row =3;
    else if (!GPIO_PinRead(GPIOD, 5U)) row =4;
    return row;
}


/**
 * @brief 
 * 
 * @param    
 * @retval
 */
char check_key(void)
{
    unsigned char row;
    if (check_button())
    {
      delay(10);
      if (check_button())
      {
        for (unsigned char col = 1; col <=3;col ++)
        {
          
          scan_col(col);
          row = check_row();
          if(row) return key[row-1][col-1];
        }
      }
      else return 0;
    }
    return 0;
}
///////////////////////////////////////////////////////////////////////////////////
#define MAX_BUTTON_COUNT    10      //
#define PRESS_TICK          300	    //
#define HOLD_TICK           200	    //
#define RELEASE_TICK        100     //

#define CURRENT_TICK 10
#define BUTTON_LOGIC_LEVEL 1 //Gia tri doc GPIO

#define SYSTEMCALLBACK void (*fnCallback)(void);

typedef enum tagSTATE
{
    IDLE = 0,
    PRESSING,
    HOLDING,
    RELEASING,
    HOLDED,
}state;

void fnCallbackIDLE(void);
typedef struct tagButton
{
    unsigned int 	nTick;			// Current tick of button.
    unsigned char   	keyButton;		// 
    unsigned char   	last_keyButton;
    char	state;			        //
    void (*fnCallbackIDLE)(unsigned char key);               // 
    void (*fnCallbackPRESS)(unsigned char key);
    void (*fnCallbackHOLD)(unsigned char key);
    void (*fnCallbackRELEASE)(unsigned char key);


}BUTTON;

void ButtonProcessEvent(BUTTON *g_pButtons)
{
   // char nIndex;
                switch(g_pButtons->state)
                {
                    case IDLE:
                    {
                        // Waiting for One pin being pressed.
                        if(g_pButtons->keyButton)
                        {
                            g_pButtons->state = PRESSING;
                            g_pButtons->nTick = g_systickCounter + PRESS_TICK;
                            g_pButtons->last_keyButton = g_pButtons->keyButton;
                        }
                        break;
                    }
                    case PRESSING:
                    {
                        // waiting for One pin being released.
                        if(g_pButtons->keyButton==0)
                        {
                            g_pButtons->state = RELEASING;
                            g_pButtons->nTick = g_systickCounter + RELEASE_TICK;
                            /*-------------------------------------------------------return  */
                            if(g_pButtons->fnCallbackPRESS != NULL)
                              {
                                g_pButtons->fnCallbackPRESS(g_pButtons->last_keyButton); // Process press event.
                                delay(10);
                              }                           
                            break;
                        }
                        else if(g_pButtons->keyButton!=g_pButtons->last_keyButton)
                        {
                            g_pButtons->state = PRESSING;
                            g_pButtons->nTick = g_systickCounter + PRESS_TICK;
                            if(g_pButtons->fnCallbackPRESS != NULL)
                              {
                                g_pButtons->fnCallbackPRESS(g_pButtons->last_keyButton); // Process press event.
                                delay(10);
                              }
                            g_pButtons->last_keyButton = g_pButtons->keyButton;
                            break;
                        }
                        
