HongHanPT/Programming/SDK_2.7.0_MKE15Z256xxx7/boards/frdmke15z/driver_examples/gpio/led_output/gpio_led_output.c
                        // Detect hold event.
                        if((g_pButtons->keyButton==g_pButtons->last_keyButton) && (g_pButtons->nTick <= g_systickCounter))
                        {

                            g_pButtons->state = HOLDING;     
                            g_pButtons->nTick = g_systickCounter + HOLD_TICK;
                            break;
                        }
                        break;
                    }
                    case HOLDING:
                    {                   
                       
                        if( g_pButtons->nTick <= g_systickCounter)
                        {
                            if(g_pButtons->fnCallbackHOLD != NULL)
                            {
                                g_pButtons->fnCallbackHOLD(g_pButtons->last_keyButton); // Process Hold event.
                                delay(10);
                            }
                            g_pButtons->state = HOLDED;
                            break;
                        }
                        if(g_pButtons->keyButton==0)
                        {
                            g_pButtons->state = RELEASING;
                            g_pButtons->nTick = g_systickCounter + RELEASE_TICK;
                            
                            if(g_pButtons->fnCallbackHOLD != NULL)
                              {
                                g_pButtons->fnCallbackHOLD(g_pButtons->keyButton); // Process Hold event.
                                delay(10);
                              }                           
                            break;
                        }
                        else if(g_pButtons->keyButton!=g_pButtons->last_keyButton)
                        {
                            g_pButtons->state = PRESSING;
                            g_pButtons->nTick = g_systickCounter + PRESS_TICK;
                            if(g_pButtons->fnCallbackHOLD != NULL)
                              {
                                g_pButtons->fnCallbackHOLD(g_pButtons->last_keyButton); // Process HOLD event.
                                delay(10);
                              }
                            g_pButtons->last_keyButton = g_pButtons->keyButton;
                            break;
                        }
                       
                        break; 
                    }
                    case HOLDED:
                      {
                        if(g_pButtons->keyButton == 0)
                        {
                          g_pButtons->state = RELEASING;
                          g_pButtons->nTick = g_systickCounter + RELEASE_TICK;
                          break;
                        }
                        else if(g_pButtons->keyButton!=g_pButtons->last_keyButton)
                        {
                            g_pButtons->state = PRESSING;
                            g_pButtons->nTick = g_systickCounter + PRESS_TICK;
                            if(g_pButtons->fnCallbackHOLD != NULL)
                              {
                                g_pButtons->fnCallbackHOLD(g_pButtons->last_keyButton); // Process HOLD event.
                                delay(10);
                              }
                            g_pButtons->last_keyButton = g_pButtons->keyButton;
                            break;
                        }
                        break;
                      }
                    case RELEASING:
                      {
                        if(g_pButtons->nTick <= g_systickCounter)
                        {
                          if(g_pButtons->fnCallbackRELEASE != NULL)
                            {
                                g_pButtons->fnCallbackRELEASE(g_pButtons->last_keyButton); // Process Hold event.
                                delay(10);
                            }
                          g_pButtons->state = IDLE;
                          break;
                        }
                        if(g_pButtons->keyButton != 0)
                        {
                          if(g_pButtons->fnCallbackRELEASE != NULL)
                            {
                                g_pButtons->fnCallbackRELEASE(g_pButtons->last_keyButton); // Process Release event.
                                delay(10);
                            }
                          g_pButtons->state = PRESSING;
                          g_pButtons->nTick = g_systickCounter + PRESS_TICK;
                          g_pButtons->last_keyButton = g_pButtons->keyButton;
                          break;
                        }
                        break;
                      }
                        break;
                }
}



/////////////////////////////////////////////////////////////////////////////////
/*
For LCD
*/
char UP, DOWN, ENTER, CANCEL;
/* ----------------------------------------
Hide 14/07/2020


void sendCommand(int instruction);
void sendData(int data);
void Init_LCD()
{
	GPIO_PinWrite(GPIOD, 14U, 1);      //CS pin
	GPIO_PinWrite(GPIOD, 13U, 0);      //Clk pin
        delay(50);   //wait for >40 ms
}

void GraphicMode ()   
{
//		sendCommand(0x30);  // 8 bit mode
//		delay (10);
//		sendCommand(0x34);  // switch to Extended instructions
//		delay (10);
		sendCommand(0x3E);  // enable graphics
		delay (10);
}
void DrawBitmap(const unsigned char* graphic)
{
	uint8_t x, y;
	for(y = 0; y < 64; y++)
	{
		if(y < 32)
		{
			for(x = 0; x < 8; x++)				// Draws top half of the screen.
			{					        // In extended instruction mode, vertical and horizontal coordinates must be specified before sending data in.
				sendCommand(0x80 | y);			// Vertical coordinate of the screen is specified first. (0-31)
				sendCommand(0x80 | x);			// Then horizontal coordinate of the screen is specified. (0-8)
				sendData(graphic[2*x + 16*y]);		// Data to the upper byte is sent to the coordinate.
				sendData(graphic[2*x+1 + 16*y]);	// Data to the lower byte is sent to the coordinate.
			}
		}
		else
		{
			for(x = 0; x < 8; x++)				// Draws bottom half of the screen.
			{						// Actions performed as same as the upper half screen.
				sendCommand(0x80 | (y-32));		// Vertical coordinate must be scaled back to 0-31 as it is dealing with another half of the screen.
				sendCommand(0x88 | x);
				sendData(graphic[2*x + 16*y]);
				sendData(graphic[2*x+1 + 16*y]);
			}
		}

