HongHanPT/Programming/SDK_2.7.0_MKE15Z256xxx7/boards/frdmke15z/driver_examples/gpio/led_output/gpio_led_output.c
	}
}

void send_1(void)
{
	GPIO_PinWrite(GPIOD, 15U, 1);
	GPIO_PinWrite(GPIOD, 13U, 1);
        delay(1);
	GPIO_PinWrite(GPIOD, 13U, 0);
}

void send_0(void)
{
	GPIO_PinWrite(GPIOD, 15U, 0);
	GPIO_PinWrite(GPIOD, 13U, 1);
        delay(1);
	GPIO_PinWrite(GPIOD, 13U, 0);
}

char read_bit(void)
{
	char value_bit;
	GPIO_PinWrite(GPIOD, 13U, 1);
	value_bit = GPIO_PinRead(GPIOD, 15U);
	GPIO_PinWrite(GPIOD, 13U, 0);
	return value_bit;
}


void sendCommand(int instruction)
{
	send_1();
	send_1();
	send_1();
	send_1();
	send_1();
	send_0();  //RW bit
	send_0();	 //RS bit
	send_0();
	for (unsigned char i=7;i>=4;i--) 
          {
            if ((instruction >> i)&0x01) send_1(); 
            else send_0(); //D7:D4
          }
        send_0();
	send_0();
	send_0();
	send_0();
	for (int i=3;i>=0;i--) 
          {
            if ((instruction >> i)&0x01) send_1(); 
            else send_0(); //D3:D0
          }
	send_0();
	send_0();
	send_0();
	send_0();
	
}

void sendData(int data)
{
	send_1();
	send_1();
	send_1();
	send_1();
	send_1();
	send_0();  //RW bit
	send_1(); //RS bit
	send_0();
	for (unsigned char i=7;i>=4;i--) 
          {
            if ((data >> i)&0x01) send_1(); 
            else send_0(); //D7:D4
          }
	send_0();
	send_0();
	send_0();
	send_0();
	for (int i=3;i>=0;i--) 
          {
            if ((data >> i)&0x01) send_1(); 
            else send_0(); //D3:D0
          }
	send_0();
	send_0();
	send_0();
	send_0();
}

void HOME()
{
    sendCommand(0x02);
}

void CLEAR()
{
    sendCommand(0x20);                  //Off Graphic Mode
    sendCommand(0x01);
}
void CLEAR2()
{
    uint8_t x, y;
    for(y = 0; y < 64; y++)
    {
            if(y < 32)
            {
                    sendCommand(0x80 | y);
                    sendCommand(0x80);
            }
            else
            {
                    sendCommand(0x80 | (y-32));
                    sendCommand(0x88);
            }
            for(x = 0; x < 8; x++)
            {
                    sendData(0);
                    sendData(0);
            }
    }
}

void ENTRY_MODE_SET()
{
    sendCommand(0x04);
}

void Display_Status(unsigned char Type_display)
{
    sendCommand(Type_display);
}

void sendString(char *String)
{
	unsigned char i = 0;
	while (String[i])
	{
		sendData(String[i]);
                //ENTRY_MODE_SET();
		i++;
	}
}
void Graphic_Off()
{
    sendCommand(0x20);
}
void SelectLine(unsigned char line)
{
  if(line == 2) sendCommand(0x90);
  else if (line ==3) sendCommand(0x88);
  else if (line ==4) sendCommand(0x98);
  else if (line == 1) sendCommand(0x80);
}

void setPos(unsigned int x, int y)
{
  int instruction =0;
  if (y>8) y=8;
  if (x>4) x=4;
  if (x == 1)
  {
      instruction = 128 + y;
  }
  else if (x==2)
  {
      instruction = 144 +y;
  }
  else if (x==3)
  {
      instruction = 136 +y;
  }
  else 
  {
      instruction = 152 +y;
  }
  sendCommand(instruction);
}




*Menu tree-----------------------------------------------------------
/////////////////////////////////////////////////////////////////////////////////
typedef struct Tree{
  char *text;
  char press1;
  char press2;
  char hold1;
  char hold2;
  char press0;
}MenuEntry;
char x, y=1, M = 3;
typedef struct  Mia_t MenuItem_t;
struct Mia_t
{
  char *name;
  char number;
  MenuItem_t *parent;
  MenuItem_t *child;
  MenuItem_t *brother;
  void(*fnCallback);
  //MenuItem_t av[];
};
MenuItem_t *root;


void show_menu_new()
{
  HOME();
  sendString("        ");
  HOME();
  sendString(root->name);
  for(unsigned char i=2; i<=M+1; i++)
    {
      SelectLine(i);
      sendData(' ');
    }
  if(root->child!=NULL)
  {
    SelectLine(vitri+1);
    sendData(0x1A);
    MenuItem_t *cusor1;
    cusor1 = root->child;
    char i;
    if (y-vitri +1 ==1) 
    {
        setPos(2,1);
        sendString("                ");
        setPos(2,1);
        sendString(cusor1->name);
        cusor1 = cusor1->brother;
        i=2;
    }
    else
    {
        for(char i =1; i< y-vitri +1;i++)
        {
          cusor1 = cusor1 -> brother; 
        }
        i=1;
    }
    while(cusor1!= NULL&& i<=M)
        {
          
          i++;
          setPos(i,1);
          sendString("              ");
          setPos(i,1);
          sendString(cusor1->name);//Lan luot hien ten cua cac menu con
          cusor1 = cusor1->brother;
        }
    for (char j=i; j<M+1;j++)   //Xoa nhung dong k dung den
        {
          setPos(j+1,1);
          sendString("              ");
        }
  }
}


void browse_new()
{
  show_menu_new();
  if (UP == 1)
  {
    UP=0;
    if(y>1)
    {
      y--;
      vitri--;
      if (y >1) vitri =2;
    }
  }
  if (DOWN == 1)
  {
    DOWN = 0;
//    if (y ==1) 
//    {
//      if(root ->child -> brother !=NULL)
//      {
//        y++;
//        vitri++;
//      }
//    }
//    else if (y>1)
    {
      MenuItem_t *cusor2;
      cusor2 = root -> child;
      for(unsigned char i=1;i<y; i++)
      {
        cusor2 = cusor2->brother;
      }
      if(cusor2 -> brother !=NULL)
      {
        y++;
        vitri++;
        if (y<cusor2->parent->number) vitri=M-1;
      }
    }
  }
  if (ENTER == 1)
  {
    ENTER =0;
    if (root ->child!= NULL)
    {
      root = root -> child;
      for(unsigned char i=1;i<y; i++)
      {
        root = root->brother;
      }
      if (root -> child ==NULL)
      {
        //root ->fnCallback;
        root = root ->parent;
      }
      else 
      {
        y =1;
        vitri =1;
      }
    }
  }
  if (CANCEL == 1)
  {
    CANCEL = 0;
    if(root -> parent!=NULL)
    {
      root = root -> parent;
    }
    y=1;
    vitri =1;
  }
}

void Add(MenuItem_t *root1, MenuItem_t *child1)
{
  if(root1 -> child == NULL)
  {
    root1 ->   child = child1;
    child1 -> parent = root1;
  }
  
  else
  {
    MenuItem_t *p;
    p= root1 -> child;
    while(p->brother!=NULL)
    {
      p= p-> brother;
    }
    p->brother = child1;
    child1 -> parent = root1;
  }
  root1->number ++;

}

MenuEntry Menu[]=
{
  {"Main", 1, 2, 3, 4, 0},                //0
  {"Sub1", 5, 5, 1, 1, 0},                //1
  {"Sub2", 2, 2, 2, 2, 0},                //2
  {"Sub3", 3, 3, 3, 3, 0},                //3
  {"Sub4", 4, 4, 4, 4, 0},                 //4
  {"Sub1_1",5, 5, 5, 5, 0}
};

void ShowMenu()
{
  HOME();
  //CLEAR();
  sendString(Menu[selected].text);
  if(selected == 0)
  {
      SelectLine(2);
      sendString("Press OR HOLD");
      SelectLine(3);
      sendString("1 OR 2");
  }
  if(selected == 1)
  {
      SelectLine(2);
      sendString("Pressed1");
      SelectLine(3);
      sendString("Press 0 to back");
  }
  if(selected == 2)
  {
      SelectLine(2);
      sendString("Pressed2");
      SelectLine(3);
      sendString("Press 0 to back");
  }
  if(selected == 3)
  {
      SelectLine(2);
      sendString("Holded1");
      SelectLine(3);
      sendString("Press 0 to back");
  }
  if(selected == 4)
  {
      SelectLine(2);
      sendString("Holded2");
      SelectLine(3);
      sendString("Press 0 to back");
  }
}

void BrowseMenu()
{
    ShowMenu();
    if(PRESS1)
    {
      selected = Menu[selected].press1;
      PRESS1 =0;
    }
    if(PRESS2)
    {
      selected = Menu[selected].press2;
      PRESS2=0;
    }
    if(HOLD1)
    {
      selected = Menu[selected].hold1;
      HOLD1 = 0;
    }
    if(HOLD2)
    {
      selected = Menu[selected].hold2;
      HOLD2=0;
    }
    if(PRESS0)
    {
      selected = Menu[selected].press0;
      PRESS0=0;
    }
    
