HongHanPT/Programming/SDK_2.7.0_MKE15Z256xxx7/boards/frdmke15z/driver_examples/gpio/led_output/gpio_led_output.c
}
 */                       
/*End Menu tree*/

/*Test state machine*/
void eventPressA(unsigned char key)
{
/* 09/07 */
/*  if(key)
    {
      Graphic_Off();
      CLEAR();
      HOME();
      sendData(key);
      sendData('-');
    }*/
 /////////////////////////
 /* 10/07   morning*/
/*  if (key == '1')
  {
    PRESS1 = 1;
  }
  if (key == '2')
  {
    PRESS2 = 1;
  }
    if (key == '0')
  {
    PRESS0 = 1;
  }*/
  
  /* Afternoon 10/07*/
  //browse_new();
  if (key == '7')
  {
    CANCEL = 1;
  }
  if (key == '#')
  {
    ENTER = 1;
  }
    if (key == '0')
  {
    DOWN = 1;
  }
      if (key == '8')
  {
    UP = 1;
  }
  //browse_new();
}
void eventHoldA(unsigned char key)
{
  /* 09/07 */
  if(key)
  {
   HOME();
   sendData(key);
   sendData('+');
//    sendCommand(0x80||y);
//    sendCommand(0x80||x);
   //sendData(0xF8);
//    x++;
//    y++;
   // DrawBitmap(Untitled);
  }
  
  
  
   /////////////////////////
 /* 10/07*/
    if (key == '1')
  {
    HOLD1 = 1;
  }
  if (key == '2')
  {
    HOLD2 = 1;
  }
}
/* ------------------------------- */
/*!
 * @brief Main function
 */

MenuItem_t Main = {.name= "Main", .number =0}; 
MenuItem_t Menu1 = {.name= "Menu1", .number =0}; 
MenuItem_t Menu2 = {.name= "Menu2", .number =0}; 
MenuItem_t Menu11 = {.name= "A", .number =0}; 
MenuItem_t Menu12 = {.name= "B", .number =0}; 
MenuItem_t Menu13 = {.name= "C", .number =0}; 
MenuItem_t Menu14 = {.name= "D", .number =0}; 
MenuItem_t Menu21 = {.name= "C", .number =0}; 
MenuItem_t Menu22 = {.name= "D", .number =0}; 
MenuItem_t Menu111 = {.name= "E", .number =0}; 
MenuItem_t Menu121 = {.name= "F", .number =0};
MenuItem_t Menu122 = {.name= "G", .number =0}; 
//MenuItem_t *root;

int main(void)
{
    /* Define the init structure for the output LED pin*/
    gpio_pin_config_t out_config = {
        kGPIO_DigitalOutput,
        1,
    };
    
    gpio_pin_config_t in_config = {
        kGPIO_DigitalInput,
        1,
    };

    /* Board pin, clock, debug console init */
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    /* Print a note to terminal. */
    PRINTF("\r\n GPIO Driver example\r\n");

    /* Init output GPIO. */
    GPIO_PinInit(GPIOE, 8U, &out_config);       /*Col1 button*/
    GPIO_PinInit(GPIOB, 5U, &out_config);       /*Col2 button*/
    GPIO_PinInit(GPIOC, 3U, &out_config);       /*Col3 button*/
      
    GPIO_PinInit(GPIOD, 14U, &out_config);      /*CS pin LCD*/
    GPIO_PinInit(GPIOD, 15U, &out_config);      /*DATA pin LCD*/
    GPIO_PinInit(GPIOD, 13U, &out_config);      /*CLK pin LCD*/
    GPIO_PinInit(GPIOA, 9U, &out_config);       /*LED pin LCD*/
    
    /* Init input GPIO. */
    GPIO_PinInit(GPIOC, 2U, &in_config);        /*Row1 button*/
    GPIO_PinInit(GPIOD, 6U, &in_config);        /*Row2 button*/
    GPIO_PinInit(GPIOD, 7U, &in_config);        /*Row3 button*/
    GPIO_PinInit(GPIOD, 5U, &in_config);        /*Row4 button*/
    
    Init();
    Graphic_Off();
    sendData('0');
    CLEAR();
    Add(&Main, &Menu1);
   // uint8_t a = sizeof(Main);
    Add(&Main, &Menu2);
    Add(&Menu1, &Menu11);
    Add(&Menu1, &Menu12);
    Add(&Menu1, &Menu13);
    Add(&Menu1, &Menu14);
    Add(&Menu2, &Menu21);
    Add(&Menu2, &Menu22);
    Add(&Menu11, (MenuItem_t *)&Menu111);
    Add(&Menu12, (MenuItem_t *)&Menu121);
    Add(&Menu12, (MenuItem_t *)&Menu122);
    initSignalControl(&ENTER, &UP, &DOWN, &CANCEL);
    setMaxShowedMenu(3);
 //   GraphicMode();

    //CLEAR2();
//    HOME();
//    sendData('0');
    Display(DISPLAY_ON);
//    DrawBitmap(Untitled);
    BUTTON buttonA = 
    {
      .state = IDLE,		      
      .fnCallbackPRESS = eventPressA,
      .fnCallbackHOLD = eventHoldA,
    };
    
    if (SysTick_Config(SystemCoreClock / 1000U))
    {
        while (1)
        {
        }
    }
    //root = &Main;
//    sendCommand(0xA0);
//    sendCommand(0xA0);
    //CLEAR2();
//    browse_new();
    while (1)
    {
        //CLEAR();

       delay(1);
//        unsigned char key1=0;
       buttonA.keyButton = 0;
       buttonA.keyButton = check_key(); 
       ButtonProcessEvent(&buttonA);
//       if(check_key())
//       {
         browse_new(&Main);
//       }
       //BrowseMenu();
    }
}
